#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + login_theme                               = "moh-app-realm-idp-restriction"
      + name                                      = "IVF Portal"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = false
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://bcministryofhealth-ivfportal--ivfdev.sandbox.my.salesforce.com/*",
          + "https://bcministryofhealth-ivfportal--ivfqa.sandbox.my.salesforce.com/*",
        ]

      + authentication_flow_binding_overrides {
          + browser_id = "9e34841a-ef45-47d7-a08a-cb65bc9130e0"
        }
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.IVF-PORTAL.keycloak_openid_client_default_scopes.client_default_scopes will be created
  + resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      + client_id      = (known after apply)
      + default_scopes = [
          + "bcprovider_aad",
          + "idir_aad",
        ]
      + id             = (known after apply)
      + realm_id       = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.IVF-PORTAL.keycloak_openid_user_client_role_protocol_mapper.Client-Role-Mapper-IVF will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "Client-Role-Mapper-IVF" {
      + add_to_access_token         = true
      + add_to_id_token             = true
      + add_to_userinfo             = true
      + claim_name                  = "roles"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "IVF"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "Client Role Mapper for IVF"
      + realm_id                    = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.IVF-PORTAL.keycloak_openid_user_session_note_protocol_mapper.IDP will be created
  + resource "keycloak_openid_user_session_note_protocol_mapper" "IDP" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + claim_name          = "identity_provider"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "IDP"
      + realm_id            = "moh_applications"
      + session_note        = "identity_provider"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.IVF-PORTAL.module.client-roles.keycloak_role.ROLES["bdsb-admin"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "bdsb-admin"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.IVF-PORTAL.module.client-roles.keycloak_role.ROLES["clinic-admin"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "clinic-admin"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-ivf-portal"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "cc4d80a5-4a1c-4d80-a2c3-59d3ebde880d"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-ivf-portal"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "ab6e0d99-9205-4625-8ea4-88835ddd36ae"
      + id        = (known after apply)
      + name      = "view-client-ivf-portal"
      + realm_id  = "moh_applications"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*